both/app/controllers/followings_controller.rb

INSERT INTO "followings" ("follower", "followee", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower", 72], ["followee", 72], ["created_at", "2022-11-03 22:15:26.110526"], ["updated_at", "2022-11-03 22:15:26.110526"]]
---
    def newFollowing
        if session[:user_id]
            following = Following.create({
                follower: session[:user_id],
                followee: params[:followee]
            })

SELECT "followings".* FROM "followings" WHERE "followings"."follower" = ? AND "followings"."followee" = ?  [["follower", 72], ["followee", 72]]
---
    def checkFollowing
        if !session[:user_id]
            return render json:{error: 'Not logged in.'}, status: :forbidden
        end
        following = Following.where(follower: session[:user_id], followee: params[:followee])

SELECT "followings".* FROM "followings" WHERE "followings"."follower" = ?  [["follower", 71]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 71]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."post_id" = ? LIMIT ?  [["post_id", 75], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "posttags" ON "tags"."id" = "posttags"."tag_id" WHERE "posttags"."post_id" = ?  [["post_id", 75]]
---
    def makefeed
        if !session[:user_id]
            return render json: {error: "not logged in"}
        end
        #gather all followings where the current user is the follower into an array
        followings = Following.where(follower: session[:user_id])
        #make an array out of only the followees
        followedUsers = followings.map{|i| i.followee}
        #for each of these, gather all the posts (in reality, we'd do only in the past week)
        #put all of those in an array
        feedPosts = []
        followedUsers.each{|i|
            postswhere = Post.where(user_id: i)
            postswhere.each{|j|
                 feedPosts.push({
                    post: j,
                    recipe: j.recipe,
                    recipepic: j.recipe ? rails_blob_path(j.recipe.pic) : nil,
                    pics: j.pics.map{|p| rails_blob_path(p) },
                    tags: tagnames(j.tags)
                 })

SELECT "users".* FROM "users" WHERE "users"."UserName" = ? LIMIT ?  [["UserName", "Dan"], ["LIMIT", 1]]
SELECT "followings".* FROM "followings" WHERE "followings"."followee" = ?  [["followee", 96]]
---
    def followersof
        userid = User.find_by(UserName: params[:user])
        users = Following.where(followee: userid.id)

SELECT "users".* FROM "users" WHERE "users"."UserName" = ? LIMIT ?  [["UserName", "Dan2"], ["LIMIT", 1]]
SELECT "followings".* FROM "followings" WHERE "followings"."follower" = ?  [["follower", 72]]
---
    def followedby
        userid = User.find_by(UserName: params[:user])
        users = Following.where(follower: userid.id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 72], ["LIMIT", 1]]
---
    def getuserslist(foll, isfollowedby)
      #  foll = Following.where({follower: userId})
         if !foll[0]
             return {error: "No such followings."}
         end
        follo = []
        listofUsers = foll.each{|i|
        user= isfollowedby ? User.find_by(id: i.followee) : User.find_by(id: i.follower)