both/app/controllers/messages_controller.rb

   def create
    message = Message.create(allowed)
---
INSERT INTO "messages" ("sender", "recipient", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sender", 72], ["recipient", 71], ["content", "sgf"], ["created_at", "2022-11-03 22:37:48.981673"], ["updated_at", "2022-11-03 22:37:48.981673"]]

    def firstmessages

        if !session[:user_id]
            return render json:{error: 'Not logged in.'}, status: :forbidden
        end


        lasts = []
        messages = Message.where(recipient: session[:user_id]).or(Message.where(sender: session[:user_id]))
---
SELECT "messages".* FROM "messages" WHERE ("messages"."recipient" = ? OR "messages"."sender" = ?)  [["recipient", 72], ["sender", 72]]

    def messagethread

        if !session[:user_id]
            return render json:{error: 'Not logged in.'}, status: :forbidden
        end

        messages = Message.where(recipient: session[:user_id], sender: params[:id]).or(Message.where(sender: session[:user_id], recipient: params[:id]))
---
SELECT "messages".* FROM "messages" WHERE ("messages"."recipient" = ? AND "messages"."sender" = ? OR "messages"."sender" = ? AND "messages"."recipient" = ?)  [["recipient", 72], ["sender", 71], ["sender", 72], ["recipient", 71]]

    def messagenotification(message)

      #  message = Message.find_by(messageid)

        if !message
            return render json: {error: "No such message."}
        end

        Notification.create({
            whichpost: 0,
            user_id: message.recipient,
            read: "unread",
            content: "You have a new message."
        })
---
INSERT INTO "notifications" ("content", "read", "user_id", "whichpost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "You have a new message."], ["read", "unread"], ["user_id", 71], ["whichpost", 0], ["created_at", "2022-11-03 22:37:49.000948"], ["updated_at", "2022-11-03 22:37:49.000948"]]

        def makeuser(userid)
            user=User.find_by(id: userid)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 71], ["LIMIT", 1]]

        def makeua(j)
            user = j.sender == session[:user_id] ? User.find_by(id:j[:recipient]) : user=User.find_by(id:j[:sender])
            avatar = rails_blob_path(user.avatar)
            return {
                otheruser: j.sender == session[:user_id] ? j.recipient : j.sender,
                sender:j.sender == session[:user_id] ? "You" : User.find(j.sender).UserName,
                content: j.content,
                user: user.UserName,
                avatar: avatar}
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 71], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 72], ["LIMIT", 1]]