both/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", nil]]
SELECT "tags".* FROM "tags" INNER JOIN "posttags" ON "tags"."id" = "posttags"."tag_id" WHERE "posttags"."post_id" = ?  [["post_id", 76]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."post_id" = ? LIMIT ?  [["post_id", 76], ["LIMIT", 1]]
SELECT "followings".* FROM "followings" WHERE "followings"."followee" = ?  [["followee", 71]]
SELECT "followings".* FROM "followings" WHERE "followings"."follower" = ?  [["follower", nil]]
---
    def userposts
        posts = Post.where(user_id: params[:id])
        postnums = posts.map {|i| i.id }
        postsWithInfo = posts.map{|i| {
                post: i,
                recipe: i.recipe,
                recipepic: i.recipe ? rails_blob_path(i.recipe.pic) : nil,
                pics: i.pics.map{|p| rails_blob_path(p) },
                tags: i.tags ? tagnames(i.tags) : []
        }}
        sortedPosts = postsWithInfo.sort{|i| i[:post][:created_at]}

      howmanyfollowers = Following.where(followee: params[:id])
      howmanyfollowees = Following.where(follower: params[:id])
      follow = {
        followers: howmanyfollowers.length,
        followees: howmanyfollowees.length

INSERT INTO "posts" ("title", "place", "description", "captions", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "sdgf"], ["place", "gfds"], ["description", "fgd"], ["captions", "gfd||gdf"], ["user_id", 72], ["created_at", "2022-11-03 22:14:41.262251"], ["updated_at", "2022-11-03 22:14:41.262251"]]
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-11-03 22:14:41.272940"], ["id", 76]]
---
    def create

        if !session[:user_id]
            return render json:{error: 'Not logged in.'}, status: :forbidden
        end

        post = Post.create!(allowed)

        if post.save

SELECT "tags".* FROM "tags" INNER JOIN "posttags" ON "tags"."id" = "posttags"."tag_id" WHERE "posttags"."post_id" = ?  [["post_id", 76]]
---
    def tagnames(tags)
        tags.map{|i| i.tag}