both/app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."tag" = ? LIMIT ?  [["tag", "dgf"], ["LIMIT", 1]]
SELECT "posttags".* FROM "posttags"
SELECT "tags".* FROM "tags"
---
    def maketags
        if !session[:user_id]
            return render json: ({error: "Not logged in."})
        end
        tags = params[:tags].split(" ")
        werethere = []
        tags.each{|i|
            found = Tag.find_by(tag: i)
            found ? werethere.push(messwithtags(found.id)): werethere.push(maketag(i))}
        render json: {tags: Tag.all, posttags: Posttag.all}

INSERT INTO "tags" ("tag", "created_at", "updated_at") VALUES (?, ?, ?)  [["tag", "dgf"], ["created_at", "2022-11-03 22:14:42.347319"], ["updated_at", "2022-11-03 22:14:42.347319"]]
INSERT INTO "posttags" ("post_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 76], ["tag_id", 22], ["created_at", "2022-11-03 22:14:42.412072"], ["updated_at", "2022-11-03 22:14:42.412072"]]
---
def maketag(i)
    smallTag = i.downcase
    newtag = Tag.create({tag: smalltag})
    postNo = params[:postId].to_i
    newposttag = Posttag.create({
        post_id: postNo,
        tag_id: newtag.id
    })

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
---
def tagnames(tags)
    tags.map{|i| i.tag}