both/app/controllers/users_controller.rb

    def getme
        if session[:user_id]
            user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 71], ["LIMIT", 1]]

    def getid
        user = User.find_by(UserName: params[:name])
        if user
            avatar = rails_blob_path(user.avatar)
            howmanyfollowers = Following.where(followee: user.id)
            howmanyfollowees = Following.where(follower: user.id)
            follow = {
              followers: howmanyfollowers.length,
              followees: howmanyfollowees.length
---
SELECT "users".* FROM "users" WHERE "users"."UserName" = ? LIMIT ?  [["UserName", "Dan2"], ["LIMIT", 1]]
SELECT "followings".* FROM "followings" WHERE "followings"."follower" = ? AND "followings"."followee" = ?  [["follower", 72], ["followee", 71]]
SELECT "followings".* FROM "followings" WHERE "followings"."follower" = ?  [["follower", nil]]
SELECT "followings".* FROM "followings" WHERE "followings"."follower" = ? AND "followings"."followee" = ?  [["follower", 79], ["followee", 89]]

    def create
        user=User.create!(allowed)
        session.delete :user_id

        if user.save
---
INSERT INTO "users" ("UserName", "password_digest", "ActualName", "Description", "Pronouns", "Website", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2023-02-24 04:08:59.960474"], ["id", 106]]

    def update
        user=User.find_by(id:params[:id])
        user.update(allowed)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 89], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2023-02-24 03:50:55.883180"], ["id", 89]]

    def userAvatar
        user=User.find_by(id:params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 71], ["LIMIT", 1]]

    def update
        user=User.find_by(id:params[:id])
        if user
            user.update(allowed)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 89], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2023-02-24 03:50:55.883180"], ["id", 89]]

    def destroy
        user=User.find_by(id:params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 106], ["LIMIT", 1]]

    def createstuff(id)

        dan = User.find_by(UserName: "Dan")

        Notification.create({
            content: "Welcome to FoodBook!!",
            read: "unread",
            user_id: id,
            whichpost: 0,
        })

        Following.create({
            follower: id,
            followee: id,
        })

        Following.create({
            follower: id,
            followee: dan.id,
        })
---
SELECT "users".* FROM "users" WHERE "users"."UserName" = ? LIMIT ?  [["UserName", "Dan"], ["LIMIT", 1]]
INSERT INTO "notifications" ("content", "read", "user_id", "whichpost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "Welcome to FoodBook!!"], ["read", "unread"], ["user_id", 106], ["whichpost", 0], ["created_at", "2023-02-24 04:09:00.019470"], ["updated_at", "2023-02-24 04:09:00.019470"]]
INSERT INTO "followings" ("follower", "followee", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower", 106], ["followee", 106], ["created_at", "2023-02-24 04:09:00.032899"], ["updated_at", "2023-02-24 04:09:00.032899"]]
INSERT INTO "followings" ("follower", "followee", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower", 106], ["followee", 104], ["created_at", "2023-02-24 04:09:00.040748"], ["updated_at", "2023-02-24 04:09:00.040748"]]